'number' + 3 + 3 // number33 - конкатенація стрінги і намберів дасть стрінг

null + 3 // 3 - складання нуля і тройки

5 && "qwerty" // qwerty

+'40' + +'2' + "hillel"; // 42hillel - звичаний стрінг як складання стрінгів

'10' - 5 === 6; // false - ліворуч від === буде стрінг який не дорівнює за форматом

true + false // 1 = 0 + 1

'4px' - 3 // NaN 

'4' - 3 // 1 перетворення в намбер і дія 4-3=1

'6' + 3 ** 0; // 61 - спочатку підносимео 3 в ступінь 0 = 1 і далі до перетвореної 6 конкатенацією додаємо 1 = 61

12 / '6' // думаю шо має бути два, але можу помилитись - не помилився :)

'10' + (5 === 6); // 10false - стрінг + 5 не дорівнює 6 - false

null == '' // false - null не дорівняє нічому, важко 

3 ** (9 / 3); // ділення перше, бо дужки - буде 3, далі 3 в ступені 3 - 27

!!'false' == !!'true' // тут важко - мабуть true - так, бо !!'false' - це тру і !!'true' - це тру, а тру = тру, то вивід тру.

0 || '0' && 1 // не можу пояснити тут, консоль дає 1

(+null == false) < 1; // false - +null = 0, далі  0 == false що тру, а true це  1, що не < 1, тому false

false && true || true // ліворуч false - true / праворуч тру або тру обидва тру, тому тру

false && (false || true); // ліворуч false - true / праворуч false, тому фолс, але дія дужок не зрозуміла

(+null == false) < 1 ** 5; // false - бо теж саме шо і раніше, але 1 в ступіні 5 - завжди 1
